  1. 데이터셋  영화 타이틀 데이터 셋. 
      -. moves_title.csv 
  2. titles의 Data Frame을 만든다. 
  3. df 필수 명령 8가지 실행 

  4. 전체 영화는 몇개인가? 
  5. 가장 빠른 시기에 제작된 영화 2개를 찾아라. 
  6. 제목이 "Hamlet"인 영화는 몇개인가? 
  7. 제목이 "Treasure Island"는 몇개인가? 제작년도 오름차순으로 나열
  8. 1950년에서 1959년사이에 만들어진 영화는 몇개인가? 

  다 끝나신분.. numpy quickstart 학습.. 
  https://numpy.org/doc/stable/user/quickstart.html

In [1]:
import pandas as pd

In [2]:
film = pd.read_csv('C:/Users/user/Downloads/movies_title.csv')

film

                          title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]

In [3]:
film.head()

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993
4                   The 86  2015

In [4]:
film.tail()

                      title  year
215976       Le mouton noir  1922
215977  Edge of the Unknown  2015
215978                E yue  2005
215979         Lakota Girls  2015
215980         The Sting II  1983

In [5]:
film.shape

(215981, 2)

In [6]:
film.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215981 entries, 0 to 215980
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   215981 non-null  object
 1   year    215981 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.3+ MB

In [7]:
film.describe()

                year
count  215981.000000
mean     1984.553822
std        29.343957
min      1894.000000
25%      1965.000000
50%      1994.000000
75%      2010.000000
max      2024.000000

In [8]:
film.columns

Index(['title', 'year'], dtype='object')

In [9]:
film.isnull().sum()

title    0
year     0
dtype: int64

In [10]:
film['title'].value_counts()

Hamlet                                  19
Macbeth                                 14
Carmen                                  14
The Three Musketeers                    12
Maya                                    11
                                        ..
Sheng gang qi bing                       1
Murder: Ultimate Grounds for Divorce     1
Aprendiz de policia                      1
Excexos                                  1
Sea Raiders                              1
Name: title, Length: 197575, dtype: int64

In [11]:
film['year'].value_counts().sort_values

<bound method Series.sort_values of 2015    13978
2014     8209
2013     7664
2012     7273
2011     6844
        ...
1899        2
2024        2
1903        1
1897        1
1894        1
Name: year, Length: 124, dtype: int64>

In [12]:
# 전체 영화 수

film['title'].value_counts().sum()

215981

In [13]:
#가장 빠른 시기에 제작된 영화 2개

##value_counts().sort_index() 상위 두 개 값만 뽑아오는 경우?

film['year'].value_counts().sort_index()

1894     1
1897     1
1899     2
1900     4
1903     1
        ..
2019    46
2020    36
2021     8
2022     3
2024     2
Name: year, Length: 124, dtype: int64

In [14]:
film.loc[(film['year'] == 1894)]

             title  year
165182  Miss Jerry  1894

In [15]:
film.loc[(film['year'] == 1897)]

                                                   title  year
85708  Reproduction of the Corbett and Fitzsimmons Fight  1897

In [16]:
#제목이 "Hamlet"인 영화는 몇개인가?

film.loc[(film['title'] == 'Hamlet')].value_counts().sum()

19

In [17]:
#제목이 "Treasure Island"는 몇개인가? 제작년도 오름차순으로 나열

film.loc[(film['title'] == 'Treasure Island')].value_counts().sort_index()

title            year
Treasure Island  1918    1
                 1920    1
                 1934    1
                 1950    1
                 1972    1
                 1973    1
                 1985    1
                 1999    1
dtype: int64

In [18]:
#1950년에서 1959년사이에 만들어진 영화는 몇개인가?

F = []
for i in film ['year']:
    if i > 1950 and i<1959:
        F.append(i)
print("1950년에서 1959년 사이 만들어진 영화는 {}개 이다.".format(len(F)))

1950년에서 1959년 사이 만들어진 영화는 9697개 이다.